{
  "architectures": [
    "Gemma2ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_logit_softcapping": 50.0,
  "bos_token_id": 2,
  "dtype": "float32",
  "eos_token_id": 1,
  "final_logit_softcapping": 30.0,
  "head_dim": 256,
  "hidden_activation": "gelu_pytorch_tanh",
  "hidden_size": 8,
  "initializer_range": 0.02,
  "intermediate_size": 32,
  "layer_types": [
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 8192,
  "model_type": "gemma2",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "pad_token_id": 0,
  "query_pre_attn_scalar": 256,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "transformers_version": "4.57.0.dev0",
  "use_cache": true,
  "vocab_size": 256000
}
