{
  "architectures": [
    "LlavaNextForConditionalGeneration"
  ],
  "image_grid_pinpoints": [
    [
      384,
      384
    ],
    [
      384,
      768
    ],
    [
      384,
      1152
    ],
    [
      384,
      1536
    ],
    [
      384,
      1920
    ],
    [
      384,
      2304
    ],
    [
      384,
      2688
    ],
    [
      384,
      3072
    ],
    [
      384,
      3456
    ],
    [
      384,
      3840
    ],
    [
      768,
      384
    ],
    [
      768,
      768
    ],
    [
      768,
      1152
    ],
    [
      768,
      1536
    ],
    [
      768,
      1920
    ],
    [
      1152,
      384
    ],
    [
      1152,
      768
    ],
    [
      1152,
      1152
    ],
    [
      1536,
      384
    ],
    [
      1536,
      768
    ],
    [
      1920,
      384
    ],
    [
      1920,
      768
    ],
    [
      2304,
      384
    ],
    [
      2688,
      384
    ],
    [
      3072,
      384
    ],
    [
      3456,
      384
    ],
    [
      3840,
      384
    ]
  ],
  "image_seq_length": 576,
  "image_token_index": 49155,
  "model_type": "llava_next",
  "multimodal_projector_bias": true,
  "projector_hidden_act": "gelu",
  "text_config": {
    "architectures": [
      "GraniteForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.1,
    "attention_multiplier": 0.015625,
    "bos_token_id": 0,
    "embedding_multiplier": 12.0,
    "eos_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 1024,
    "logits_scaling": 8.0,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "model_type": "granite",
    "num_attention_heads": 4,
    "num_hidden_layers": 4,
    "num_key_value_heads": 8,
    "pad_token_id": 0,
    "residual_multiplier": 0.22,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 300000,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 49156
  },
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "use_image_newline_parameter": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 256,
    "image_size": 384,
    "intermediate_size": 512,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 4,
    "num_channels": 3,
    "num_hidden_layers": 4,
    "patch_size": 14
  },
  "vision_feature_layer": [
    -24,
    -20,
    -12,
    -1
  ],
  "vision_feature_select_strategy": "full"
}
